package main

import (
	"fmt"
	"math/rand"
	"sync"
)

// Задача 2: Обработка данных с помощью каналов

// Описание: Создайте программу, в которой одна горутина генерирует числа от 1 до 10 и отправляет их через канал.
// Другая горутина читает числа из канала и выводит их на экран. После отправки всех чисел закройте канал и завершите программу.

// Требования:

//     Используйте каналы для передачи данных.
//     Горутина-генератор должна отправлять числа и закрывать канал после этого.
//     Горутина-потребитель должна читать из канала и выводить числа, пока канал не закрыт.

var wg sync.WaitGroup

func main() {
	kanal := make(chan int, 10)
	wg.Add(2)
	go func() {
		defer wg.Done()
		defer close(kanal)
		for i := 0; i < 10; i++ {
			kanal <- rand.Intn(10) + 1
		}
	}()
	count := 1
	go func() {
		defer wg.Done()
		for v := range kanal {
			fmt.Printf("#%-.2d - Число %d\n", count, v)
			count++
		}
	}()
	wg.Wait()
}
